finHome/Documents/ПоступленияДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПоступленияДС</Name>
			<Comment>Поступления денежных средств</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПоступенияДС</xr:Item>
				<xr:Item>AccumulationRegister.ДвиженияДС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Поступления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЧленСемьи</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СоставСемьи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДоходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>9</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

finHome/Documents/ПоступленияДС/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		ЭтаФорма.Элементы.Группа3.Видимость = Истина;
		ЭтаФорма.Элементы.Группа2.Видимость = Ложь;
		ЭтаФорма.ВыборРасшифровки = 1;
		Возврат;	
	КонецЕсли;  
	
	Если Объект.Поступления.Количество() = 1 Тогда 
		ЭтаФорма.ВыборРасшифровки = 1;
		ЭтаФорма.Элементы.Группа3.Видимость = Истина;
		ЭтаФорма.Элементы.Группа2.Видимость = Ложь;
        ЗаполнитьПоляГруппыБезРасшифровки();
	ИначеЕсли Объект.Поступления.Количество() > 1 Тогда 
		ЭтаФорма.ВыборРасшифровки = 2;
		ЭтаФорма.Элементы.Группа3.Видимость = Ложь;
		ЭтаФорма.Элементы.Группа2.Видимость = Истина;
	КонецЕсли;      
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиЭлементовФормы
&НаКлиенте
Процедура РасшифровкаПриИзменении(Элемент)
	
	Если ВыборРасшифровки = 1 Тогда
		ЭтаФорма.Элементы.Группа3.Видимость = Истина;
		ЭтаФорма.Элементы.Группа2.Видимость = Ложь;
		ЗаполнитьПоляГруппыБезРасшифровки();
	Иначе
		ЭтаФорма.Элементы.Группа3.Видимость = Ложь;
		ЭтаФорма.Элементы.Группа2.Видимость = Истина;
		ЗаполнитьРасшифровкуСписком();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаБезРазбиенияЧленСемьиПриИзменении(Элемент)  
	
	РасшифровкаБезРазбиенияЧленСемьиПриИзмененииНаСервере();  
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаБезРазбиенияВидДСПриИзменении(Элемент) 
	
	РасшифровкаБезРазбиенияВидДСПриИзмененииНаСервере();  
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаБезРазбиенияСтатьяДоходовПриИзменении(Элемент) 
	
	РасшифровкаБезРазбиенияСтатьяДоходовПриИзмененииНаСервере(); 
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаБезРазбиенияСуммаПриИзменении(Элемент) 
	
	РасшифровкаБезРазбиенияСуммаПриИзмененииНаСервере(); 
	
КонецПроцедуры
#КонецОбласти

#Область Служебные
&НаСервере
Процедура РасшифровкаБезРазбиенияВидДСПриИзмененииНаСервере()
	
	Если Объект.Поступления.Количество() = 0 Тогда
		НСтр = Объект.Поступления.Добавить();
		НСтр.ВидДС = ЭтотОбъект.РасшифровкаБезРазбиенияВидДС;
	Иначе
		Объект.Поступления[0].ВидДС = ЭтотОбъект.РасшифровкаБезРазбиенияВидДС;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РасшифровкаБезРазбиенияСтатьяДоходовПриИзмененииНаСервере()
	
	Если Объект.Поступления.Количество() = 0 Тогда
		НСтр = Объект.Поступления.Добавить();
		НСтр.СтатьяДоходов = ЭтотОбъект.РасшифровкаБезРазбиенияСтатьяДоходов;
	Иначе
		Объект.Поступления[0].СтатьяДоходов = ЭтотОбъект.РасшифровкаБезРазбиенияСтатьяДоходов;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РасшифровкаБезРазбиенияСуммаПриИзмененииНаСервере()
	
	Если Объект.Поступления.Количество() = 0 Тогда
		НСтр = Объект.Поступления.Добавить();
		НСтр.Сумма = ЭтотОбъект.РасшифровкаБезРазбиенияСумма;
	Иначе
		Объект.Поступления[0].Сумма = ЭтотОбъект.РасшифровкаБезРазбиенияСумма;
	КонецЕсли;

КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьПоляГруппыБезРасшифровки()
	
	ЭтотОбъект.РасшифровкаБезРазбиенияВидДС = Объект.Поступления[0].ВидДС;
	ЭтотОбъект.РасшифровкаБезРазбиенияСтатьяДоходов = Объект.Поступления[0].СтатьяДоходов;
	ЭтотОбъект.РасшифровкаБезРазбиенияСумма = Объект.Поступления[0].Сумма;
	ЭтотОбъект.РасшифровкаБезРазбиенияЧленСемьи = Объект.Поступления[0].ЧленСемьи;
	ЗаполнитьРасшифровкуСписком();
	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьРасшифровкуСписком() 
	
	Объект.Поступления.Очистить();
	НСтр = Объект.Поступления.Добавить();
	НСтр.ВидДС = РасшифровкаБезРазбиенияВидДС;
	НСтр.СтатьяДоходов = РасшифровкаБезРазбиенияСтатьяДоходов;
	НСтр.Сумма = РасшифровкаБезРазбиенияСумма;
	НСтр.ЧленСемьи = РасшифровкаБезРазбиенияЧленСемьи;	
	
КонецПроцедуры

&НаСервере
Процедура РасшифровкаБезРазбиенияЧленСемьиПриИзмененииНаСервере()
	
	Если Объект.Поступления.Количество() = 0 Тогда
		НСтр = Объект.Поступления.Добавить();
		НСтр.ЧленСемьи = ЭтотОбъект.РасшифровкаБезРазбиенияЧленСемьи;
	Иначе
		Объект.Поступления[0].ЧленСемьи = ЭтотОбъект.РасшифровкаБезРазбиенияЧленСемьи;
	КонецЕсли;                                                                        
	
КонецПроцедуры
#КонецОбласти
